Revit 2027 API
FieldValues(FieldValues) Constructor
 Creates a copy of the given FieldValues instance.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FieldValues(
	FieldValues otherObject
)
Public Sub New (
	otherObject As FieldValues
)
public:
FieldValues(
	FieldValues^ otherObject
)
new :
        otherObject : FieldValues -> FieldValues
Parameters
otherObject FieldValues
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FieldValues Class
FieldValues Overload
Autodesk.Revit.DB.Analysis Namespace